Lab 2: Data Preparation

## A. Import Python Modules and Dataset

In [2]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import RobustScaler
import matplotlib.pyplot as plt
%matplotlib inline

df = pd.read_csv('https://raw.githubusercontent.com/mandricic/CS5062/master/bank.csv')
df.tail()

       age           job  marital  ... previous poutcome  subscribed
1995  20.0       student   single  ...        0      NaN         yes
1996  28.0        admin.   single  ...        0      NaN         yes
1997  81.0       retired  married  ...        0      NaN         yes
1998  46.0      services  married  ...        0      NaN         yes
1999  40.0  entrepreneur  married  ...        0      NaN         yes

[5 rows x 17 columns]

Check for missing values
we can Use df.isna().sum() or df.isnull().sum()

In [3]:
df.isnull().sum()

age            12
job            10
marital         0
education     104
default         0
balance         0
housing         0
loan            0
contact       191
day             0
month           0
duration        0
campaign        0
pdays           0
previous        0
poutcome      454
subscribed      0
dtype: int64

Save Original data

In [0]:
df_original = df

### Encode Ordinal Categorical Attributes

for Month we use Categorical Attribute, I will replace that with Numerical Attributes

In [5]:
month_mapper = {
    "jan": 1,
    "feb": 2,
    "mar": 3,
    "apr": 4,
    "may": 5,
    "jun": 6,
    "jul": 7,
    "aug": 8,
    "sep":9,
    "oct":10,
    "nov":11,
    "dec":12
}

df['month'] = df['month'].replace(month_mapper)

df.head()

    age          job   marital  education  ... pdays  previous poutcome subscribed
0  32.0   technician    single   tertiary  ...   131         2  failure         no
1  39.0   technician  divorced  secondary  ...   133         1  failure         no
2  59.0      retired   married  secondary  ...   239         1  failure         no
3  47.0  blue-collar   married  secondary  ...   238         2  failure         no
4  54.0      retired   married  secondary  ...   307         1  failure         no

[5 rows x 17 columns]

One-Hot Encode Education Categorical Attribute

In [6]:
df = pd.get_dummies(df, columns=['education'], 
                        dummy_na=True, 
                        drop_first=True)
df.tail()

       age           job  ... education_tertiary education_nan
1995  20.0       student  ...                  0             1
1996  28.0        admin.  ...                  0             0
1997  81.0       retired  ...                  0             0
1998  46.0      services  ...                  0             0
1999  40.0  entrepreneur  ...                  0             0

[5 rows x 19 columns]

In [7]:
df.isnull().sum()

age                     12
job                     10
marital                  0
default                  0
balance                  0
housing                  0
loan                     0
contact                191
day                      0
month                    0
duration                 0
campaign                 0
pdays                    0
previous                 0
poutcome               454
subscribed               0
education_secondary      0
education_tertiary       0
education_nan            0
dtype: int64

Impute Missing Values

In [8]:
df['poutcome'].fillna('novalue', inplace=True)
df.tail()

       age           job  ... education_tertiary education_nan
1995  20.0       student  ...                  0             1
1996  28.0        admin.  ...                  0             0
1997  81.0       retired  ...                  0             0
1998  46.0      services  ...                  0             0
1999  40.0  entrepreneur  ...                  0             0

[5 rows x 19 columns]